Revit 2024 API
WorksetDefaultVisibilitySettings.GetWorksetDefaultVisibilitySettings Method
 Get the WorksetDefaultVisibilitySettings of the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static WorksetDefaultVisibilitySettings GetWorksetDefaultVisibilitySettings(
	Document aDoc
)
Visual Basic
Public Shared Function GetWorksetDefaultVisibilitySettings ( _
	aDoc As Document _
) As WorksetDefaultVisibilitySettings
Visual C++
public:
static WorksetDefaultVisibilitySettings^ GetWorksetDefaultVisibilitySettings(
	Document^ aDoc
)
Parameters
aDoc
Type: Autodesk.Revit.DB.Document
 The document.
Return Value
 The WorksetDefaultVisibilitySettings of the document.
Remarks
 WorksetDefaultVisibilitySettings is not available in family documents.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  WorksetDefaultVisibilitySettings is not applicable to family documents.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
WorksetDefaultVisibilitySettings Class
Autodesk.Revit.DB Namespace